Revit 2024 API
ValueParsingOptions Class
 Options for parsing strings into numbers with units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class ValueParsingOptions : IDisposable
Visual Basic
Public Class ValueParsingOptions _
	Implements IDisposable
Visual C++
public ref class ValueParsingOptions : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ValueParsingOptions
See Also
ValueParsingOptions Members
Autodesk.Revit.DB Namespace